public class Мережа
{
    private List<Компютер> Компютери;

    public Мережа()
    {
        Компютери = new List<Компютер>();
    }

    public void ДодатиКомпютер(Компютер компютер)
    {
        Компютери.Add(компютер);
        Console.WriteLine($"Комп'ютер з IP {компютер.IpАдреса} доданий до мережі.");
    }

    public void ПередатиДані(Компютер відправник, Компютер одержувач, string дані)
    {
        if (відправник is IConnectable && одержувач != null)
        {
            ((IConnectable)відправник).ПередатиДані(одержувач, дані);
        }
        else
        {
            Console.WriteLine($"Передача даних від {відправник.IpАдреса} до {одержувач.IpАдреса} неможлива.");
        }
    }
}
